Kikkert2012/Fuhrman2010_boundaryCondition/system/probe2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

probe2
{
    start   (5.87764 0.069164 0);
    end     (5.78456 1.000001 0);
    fields  (U alpha.water k grad(U) nut);

    #includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

    setConfig
    {
        axis    xyz;
        nPoints	1001;
    }

    // Must be last entry
    #includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}


// ************************************************************************* //
